Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
batch_normalization_1 (Batch (None, 90, 90, 3)         12        
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 90, 90, 90)        13320     
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 90, 90, 150)       121650    
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 90, 90, 50)        187550    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 45, 45, 50)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 45, 45, 25)        11275     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 22, 22, 25)        0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 22, 22, 25)        100       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 22, 22, 64)        14464     
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 22, 22, 64)        36928     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 11, 11, 64)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 7744)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 200)               1549000   
_________________________________________________________________
dense_2 (Dense)              (None, 100)               20100     
_________________________________________________________________
dense_3 (Dense)              (None, 50)                5050      
_________________________________________________________________
dense_4 (Dense)              (None, 2)                 102       
=================================================================
Total params: 1,959,551
Trainable params: 1,959,495
Non-trainable params: 56
_________________________________________________________________
Error =  0.8324795081967213 %
Accuracy =  99.16752049180327 %
AUC =  0.9916752049180327
Confusion matrix:
[[11649    63]
 [  132 11580]]
